---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTriserNumberBaseIndex
source: html/af80cd0d-482c-2bb7-9da9-3d56f81a3d46.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTriserNumberBaseIndex Property

"Tread/Riser Start Number":

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTriserNumberBaseIndex { get; }
```